In [1]:
import pandas as pd

data = {
    'Nome': ['Ana', 'Bruno', 'Carlos', 'Diana'],
    'Idade': [28, 34, 45, 22],
    'Cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Curitiba']
}

df = pd.DataFrame(data)

df

     Nome  Idade          Cidade
0     Ana     28       São Paulo
1   Bruno     34  Rio de Janeiro
2  Carlos     45  Belo Horizonte
3   Diana     22        Curitiba

In [5]:
type(df)

pandas.core.frame.DataFrame